# *- coding:utf8 *-
city = [{"hangzhou": "杭州"}]
County = [{"杭州": [
    {"拱墅区": []},
    {"西湖区": []},
    {"滨江区": ["春波路春波小区", ]},
    {"桐庐县": []},
    {"上城区": []},
    {"余杭区": []},
    {"淳安县": []},
    {"临安市": []},
    {"萧山区": []},
    {"江干区": []},
    {"富阳市": []},
    {"下城区": []},
    {"建德市": []},
    {"其他": []}, ]}

]


LOCATION = [
    {"杭州":[
        {"1号线": [
            {"湘湖站": ["A出口", "B出口", "C出口", "E出口"]},
            {"滨康路站": ["A出口", "B出口"]},
            {"西兴站": ["B出口", "D出口"]},
            {"滨和路站": ["B出口", "C出口", "D出口"]},
            {"江陵路站": ["A出口", "B出口", "C出口", "D出口"]},
            {"近江站": ["A出口", "B出口", "C出口", "D出口", "E出口"]},
            {"婺江路站": ["A出口", "B出口", "C出口", "D出口", "E1出口"]},
            {"城站站": ["A1出口", "A2出口", "A3出口", "B1出口", "C出口", "D出口"]},
            {"定安路站": ["A出口", "B出口", "C出口", "D出口"]},
            {"龙翔桥站": ["A出口", "B3出口", "C1出口", "C1出口", "C2出口", "C3出口", "D出口"]},
            {"凤起路站": []},
            {"武林广场站": []},
            {"西湖文化广场站": []},
            {"打铁关站": []},
            {"闸弄口站": ["A出口", "B出口", "C出口", "D出口"]},
            {"火车东站站": []},
            {"彭埠站": []},
            {"七堡站": []},
            {"九和路站": []},
            {"九堡站": []},
            {"客运中心站": []},
            {"下沙西站": []},
            {"金沙湖站": []},
            {"高沙路站": []},
            {"文泽路站": []},
            {"文海南路站": []},
            {"云水站": []},
            {"下沙江滨站": []},
            {"滨江一路站": []},
            {"滨江二路站": []},
            {"南阳大道站": []},
            {"向阳路站": []},
            {"萧山机场站": []},
            {"客运中心站": []},
            {"乔司南站": []},
            {"乔司站": []},
            {"翁梅站": []},
            {"余杭高铁站站": []},
            {"南苑站": []},
            {"临平站": []},

        ]}
    ]}
]


AFTYPE = ["地铁", "生活/办公园区"]